Detected [rhel7.4i] setup

                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

                 Version N-2017.09 for linux64 - Aug 17, 2017 

                    Copyright (c) 1988 - 2017 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
Loading Design Compiler Setup
Initializing gui preferences from file  /home/msc18h28/.synopsys_dv_prefs.tcl
dc_shell> ###
dc_shell> ### Written by: Kaja Jentner
dc_shell> ### January 2019
dc_shell> ### IEF ETH Zurich
dc_shell> ########################################################
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Constants
dc_shell> #-------------------
dc_shell> set NAME {}
dc_shell> set PATH {/home/msc18h28/ma/sourcecode/tree_serializer}
/home/msc18h28/ma/sourcecode/tree_serializer
dc_shell> 
dc_shell> remove_design -all
1
dc_shell> exec rm -rf WORK/*
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Libraries
dc_shell> #-------------------
dc_shell> set CELL_LIB sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
dc_shell> set PAD_LIB io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
dc_shell> dz_set_pvt [list $CELL_LIB $PAD_LIB]
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Analyze Design
dc_shell> #==============================================================================
dc_shell> analyze -library WORK -format sverilog $PATH/toplevel_tree_serializer.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/tree_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
1
dc_shell> analyze -library WORK -format sverilog $PATH/tree_serializer_recursive.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv
Presto compilation completed successfully.
1
dc_shell> analyze -library WORK -format sverilog $PATH/Clock_divider.sv
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv
Presto compilation completed successfully.
1
dc_shell> 
dc_shell> # Set Entity To Elaborate
dc_shell> set TOP_ENTITY {toplevel_tree_serializer}
toplevel_tree_serializer
dc_shell> set ENTITY {Tree_Serializer}
Tree_Serializer
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Elaborate Design
dc_shell> #==============================================================================
dc_shell> elaborate $TOP_ENTITY
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv:40: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_tree_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
1
dc_shell> write -f ddc -o DDC/${ENTITY}_${NAME}_elab.ddc
Writing ddc file 'DDC/Tree_Serializer__elab.ddc'.
1
dc_shell> 
dc_shell> 
dc_shell> remove_design -design
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
1
dc_shell> read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
toplevel_tree_serializer
dc_shell> 
dc_shell> set MAXDELAY 1
1
dc_shell> 
dc_shell>   remove_design -design
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
1
dc_shell>   read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
toplevel_tree_serializer
dc_shell> 
dc_shell>   #------------------
dc_shell>   # Load Constraints
dc_shell>   #------------------
dc_shell>   source scripts/constraints_generated.tcl
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Warning: Can't find clock 'CLK_DIV_5' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
Warning: Can't find clock 'CLK_DIV_10' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
Warning: Can't find clock 'CLK_DIV_20' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
Warning: Can't find clock 'CLK_DIV_40' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
Warning: Can't find clock 'CLK_DIV_80' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
1
dc_shell> ########################################################
dc_shell> ###
dc_shell> ### Synthesis Script for Serializer with Tree Structure
dc_shell> ###
dc_shell> ### Written by: Kaja Jentner
dc_shell> ### January 2019
dc_shell> ### IEF ETH Zurich
dc_shell> ########################################################
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Constants
dc_shell> #-------------------
dc_shell> set NAME {}
dc_shell> set PATH {/home/msc18h28/ma/sourcecode/tree_serializer}
/home/msc18h28/ma/sourcecode/tree_serializer
dc_shell> 
dc_shell> remove_design -all
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
Removing library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
Removing library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Removing library 'gtech'
Removing library 'standard.sldb'
Removing library 'dw_foundation.sldb'
1
dc_shell> exec rm -rf WORK/*
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Libraries
dc_shell> #-------------------
dc_shell> set CELL_LIB sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
dc_shell> set PAD_LIB io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
dc_shell> dz_set_pvt [list $CELL_LIB $PAD_LIB]
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Analyze Design
dc_shell> #==============================================================================
dc_shell> analyze -library WORK -format sverilog $PATH/toplevel_tree_serializer.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/tree_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
1
dc_shell> analyze -library WORK -format sverilog $PATH/tree_serializer_recursive.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv
Presto compilation completed successfully.
1
dc_shell> analyze -library WORK -format sverilog $PATH/Clock_divider.sv
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv
Presto compilation completed successfully.
1
dc_shell> 
dc_shell> # Set Entity To Elaborate
dc_shell> set TOP_ENTITY {toplevel_tree_serializer}
toplevel_tree_serializer
dc_shell> set ENTITY {Tree_Serializer}
Tree_Serializer
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Elaborate Design
dc_shell> #==============================================================================
dc_shell> elaborate $TOP_ENTITY
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv:40: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_tree_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
1
dc_shell> write -f ddc -o DDC/${ENTITY}_${NAME}_elab.ddc
Writing ddc file 'DDC/Tree_Serializer__elab.ddc'.
1
dc_shell> 
dc_shell> 
dc_shell> remove_design -design
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
1
dc_shell> read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
toplevel_tree_serializer
dc_shell> 
dc_shell> 
dc_shell> set MAXDELAY 1
1
dc_shell> 
dc_shell>   remove_design -design
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
1
dc_shell>   read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
toplevel_tree_serializer
dc_shell> 
dc_shell>   #------------------
dc_shell>   # Load Constraints
dc_shell>   #------------------
dc_shell>   source scripts/constraints_generated.tcl
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Warning: Can't find clock 'CLK_DIV_64' in design 'toplevel_tree_serializer'. (UID-95)
Error: Value for list '<clock_list>' must have 1 elements. (CMD-036)
1
dc_shell> 
dc_shell>   #====[K[K[K[K[Ksource scripts/sh
shift_serializer_synth.tcl shifter_synth.tcl          
dc_shell> source scripts/shift_t[K[K[K[K[K[K[Ktree_serializer_synth.tcl 
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
Removing library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
Removing library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Removing library 'gtech'
Removing library 'standard.sldb'
Removing library 'dw_foundation.sldb'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/tree_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv
Presto compilation completed successfully.
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv:40: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_tree_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/toplevel_tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Writing ddc file 'DDC/Tree_Serializer__elab.ddc'.
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider'
Removing design 'Serializer_00000020_00000005_0'
Removing design 'mux_00000020'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'mux_00000010'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000008'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000004'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000002'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | N-2017.09-DWBB_201709.0 |     *     |
| Licensed DW Building Blocks        | N-2017.09-DWBB_201709.0 |     *     |
============================================================================

Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)
Information: Uniquified 5 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_tree_serializer'

Warning: The trip points for the library named io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB differ from those in the library named sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs. (TIM-164)
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_tree_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'Serializer_00000020_00000005_0'
  Processing 'Serializer_00000010_00000005_00000001'
  Processing 'toplevel_tree_serializer'
  Processing 'Serializer_00000008_00000005_00000002'
  Processing 'mux_00000020'
  Processing 'Serializer_00000004_00000005_00000003'
  Processing 'mux_00000010'
  Processing 'Serializer_00000002_00000005_00000004'
  Processing 'mux_00000008'
  Processing 'Clock_divider_0'
  Processing 'mux_00000004'
  Processing 'mux_00000002'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     366.0      0.00       0.0       0.0                             12.7210      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.7210      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.7210      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.7210      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:10     366.0      0.00       0.0       0.0                             12.7087      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     366.0      0.00       0.0       0.0                             12.6195      0.00  
  Global Optimization (Phase 30)
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:11     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:11     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:11     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:11     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:11     366.0      0.00       0.0       0.0                             12.5969      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_tree_serializer__1ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_1ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_1ns_synth.sdf'. (WT-3)
Removing design 'Serializer_00000020_00000005_0'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Clock_divider_4'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000020'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000010'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000008'
Removing design 'mux_00000004'
Removing design 'mux_00000002'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)
Information: Uniquified 5 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_tree_serializer'

  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_tree_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'Serializer_00000020_00000005_0'
  Processing 'Serializer_00000010_00000005_00000001'
  Processing 'toplevel_tree_serializer'
  Processing 'Serializer_00000008_00000005_00000002'
  Processing 'mux_00000020'
  Processing 'Serializer_00000004_00000005_00000003'
  Processing 'mux_00000010'
  Processing 'Serializer_00000002_00000005_00000004'
  Processing 'mux_00000008'
  Processing 'Clock_divider_0'
  Processing 'mux_00000004'
  Processing 'mux_00000002'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:08     366.0      0.00       0.0       0.0                             12.6903      0.00  
    0:00:08     366.0      0.00       0.0       0.0                             12.6903      0.00  
    0:00:08     366.0      0.00       0.0       0.0                             12.6903      0.00  
    0:00:08     366.0      0.00       0.0       0.0                             12.6903      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:08     366.0      0.00       0.0       0.0                             12.6903      0.00  
    0:00:08     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     366.0      0.00       0.0       0.0                             12.6080      0.00  
  Global Optimization (Phase 30)
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:09     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
    0:00:10     366.0      0.00       0.0       0.0                             12.5969      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_tree_serializer__0.5ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_0.5ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_0.5ns_synth.sdf'. (WT-3)
Removing design 'Serializer_00000020_00000005_0'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Clock_divider_4'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000020'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000010'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000008'
Removing design 'mux_00000004'
Removing design 'mux_00000002'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Tree_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_tree_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 15 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'toplevel_tree_serializer' with
	the parameters "32'h00000020,32'h00000005,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000020_00000005_0 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000020". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000020_00000005_0' with
	the parameters "32'h00000010,32'h00000005,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000005_00000001 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000010". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000005_00000001' with
	the parameters "32'h00000008,32'h00000005,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000005_00000002 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000008". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000005_00000002' with
	the parameters "32'h00000004,32'h00000005,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000005_00000003 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000004". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000005_00000003' with
	the parameters "32'h00000002,32'h00000005,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000005_00000004 line 29 in file
		'/home/msc18h28/ma/sourcecode/tree_serializer/tree_serializer_recursive.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'mux' instantiated from design 'Serializer_00000002_00000005_00000004' with
	the parameters "32'h00000002". (HDL-193)
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)
Information: Uniquified 5 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_tree_serializer'

  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_tree_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'Serializer_00000020_00000005_0'
  Processing 'Serializer_00000010_00000005_00000001'
  Processing 'toplevel_tree_serializer'
  Processing 'Serializer_00000008_00000005_00000002'
  Processing 'mux_00000020'
  Processing 'Serializer_00000004_00000005_00000003'
  Processing 'mux_00000010'
  Processing 'Serializer_00000002_00000005_00000004'
  Processing 'mux_00000008'
  Processing 'Clock_divider_0'
  Processing 'mux_00000004'
  Processing 'mux_00000002'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:08     367.5      0.08       0.2       0.0                             12.8653      0.00  
    0:00:08     372.3      0.07       0.2       0.0                             13.1584      0.00  
    0:00:08     372.3      0.07       0.2       0.0                             13.1584      0.00  
    0:00:08     374.9      0.06       0.3       0.0                             13.2872      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:08     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2872      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     374.9      0.06       0.3       0.0                             13.2876      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.7143      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.7143      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     381.6      0.06       0.3       0.0                             13.7143      0.00  
  Global Optimization (Phase 30)
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:09     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6300      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     381.6      0.06       0.3       0.0                             13.6307      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6689      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6689      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6689      0.00  
    0:00:10     381.6      0.06       0.3       0.0                             13.6689      0.00  
    0:00:10     381.4      0.06       0.3       0.0                             13.6474      0.00  
    0:00:10     381.4      0.06       0.3       0.0                             13.6474      0.00  
    0:00:10     381.4      0.06       0.3       0.0                             13.6474      0.00  
    0:00:10     381.4      0.06       0.3       0.0                             13.6474      0.00  
    0:00:11     380.9      0.06       0.3       0.0                             13.6031      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_tree_serializer__0.05ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_0.05ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Tree_Serializer_0.05ns_synth.sdf'. (WT-3)
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Constants
dc_shell> #-------------------
dc_shell> set NAME {}
dc_shell> set PATH {/home/msc18h28/ma/sourcecode/mixed_serializer}
/home/msc18h28/ma/sourcecode/mixed_serializer
dc_shell> 
dc_shell> remove_design -all
Removing design 'Serializer_00000020_00000005_0'
Removing design 'Serializer_00000010_00000005_00000001'
Removing design 'toplevel_tree_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Clock_divider_4'
Removing design 'Serializer_00000008_00000005_00000002'
Removing design 'mux_00000020'
Removing design 'Serializer_00000004_00000005_00000003'
Removing design 'mux_00000010'
Removing design 'Serializer_00000002_00000005_00000004'
Removing design 'mux_00000008'
Removing design 'mux_00000004'
Removing design 'mux_00000002'
Removing library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
Removing library 'gtech'
Removing library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Removing library 'standard.sldb'
Removing library 'dw_foundation.sldb'
1
dc_shell> exec rm -rf WORK/*
dc_shell> 
dc_shell> #-------------------
dc_shell> # Set Libraries
dc_shell> #-------------------
dc_shell> set CELL_LIB sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs
dc_shell> set PAD_LIB io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c
dc_shell> dz_set_pvt [list $CELL_LIB $PAD_LIB]
sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Analyze Design
dc_shell> #==============================================================================
dc_shell> analyze -library WORK -format sverilog $PATH/mixed_serializer.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/mixed_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
1
dc_shell> analyze -library WORK -format sverilog $PATH/shift_serializer.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv
Presto compilation completed successfully.
1
dc_shell> analyze -library WORK -format sverilog $PATH/tree_serializer.sv 
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv
Presto compilation completed successfully.
1
dc_shell> analyze -library WORK -format sverilog $PATH/Clock_divider.sv
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv
Presto compilation completed successfully.
1
dc_shell> 
dc_shell> # Set Entity To Elaborate
dc_shell> set TOP_ENTITY {toplevel_mixed_serializer}
toplevel_mixed_serializer
dc_shell> set ENTITY {Mixed_Serializer}
Mixed_Serializer
dc_shell> 
dc_shell> #==============================================================================
dc_shell> # Elaborate Design
dc_shell> #==============================================================================
dc_shell> elaborate $TOP_ENTITY
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv:39: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_mixed_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
1
dc_shell> write -f ddc -o DDC/${ENTITY}_${NAME}_elab.ddc
Writing ddc file 'DDC/Mixed_Serializer__elab.ddc'.
1
dc_shell> 
dc_shell> 
dc_shell> remove_design -design
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
1
dc_shell> read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
toplevel_mixed_serializer
dc_shell> 
dc_shell> 
dc_shell> 
dc_shell> #-------------------------------------------------------------------------------
dc_shell> #for different clocks
dc_shell> #-------------------------------------------------------------------------------
dc_shell> # foreach MAXDELAY {0.05} {
dc_shell> set MAXDELAY 0.05
0.05
dc_shell>   remove_design -design
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
1
dc_shell>   read_ddc DDC/${ENTITY}_${NAME}_elab.ddc
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
toplevel_mixed_serializer
dc_shell> 
dc_shell>   #------------------
dc_shell>   # Load Constraints
dc_shell>   #------------------
dc_shell>   source scripts/constraints_generated.tcl
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
1
dc_shell> 
dc_shell>  source scripts/mixed_serializer_synth.tcl 
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
Removing library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
Removing library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Removing library 'gtech'
Removing library 'standard.sldb'
Removing library 'dw_foundation.sldb'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/mixed_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv
Presto compilation completed successfully.
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv
Presto compilation completed successfully.
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv:39: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_mixed_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Writing ddc file 'DDC/Mixed_Serializer__elab.ddc'.
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)

Information: There are 1 potential problems in your design. Please run 'check_design' for more information. (LINT-99)

Information: Uniquified 4 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_mixed_serializer'

Warning: The trip points for the library named io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB differ from those in the library named sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs. (TIM-164)
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_mixed_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'shift_serializer_00000020_00000005_00000010'
 Implement Synthetic for 'shift_serializer_00000020_00000005_00000010'.
  Processing 'Serializer_00000010_00000004_0'
  Processing 'toplevel_mixed_serializer'
  Processing 'Serializer_00000008_00000004_00000001'
  Processing 'Serializer_00000004_00000004_00000002'
  Processing 'tree_serializer_00000010_00000004'
  Processing 'Serializer_00000002_00000004_00000003'
  Processing 'Clock_divider_0'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)
Information: The register 'shift_serializer/Counter_SP_reg[1]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[2]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[3]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[5]' is a constant and will be removed. (OPT-1206)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)
  Global Optimization (Phase 30)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:10     397.6      0.00       0.0       0.0                             13.6956      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:10     396.2      0.00       0.0       0.0                             13.6357      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
  Global Optimization (Phase 41)
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_mixed_serializer__1ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_1ns.v'.
Error: can't read "ENTITY_": no such variable
	Use error_info for more info. (CMD-013)
dc_shell> source scripts/mixed_serializer_synth.tcl[26G[Pconstraints_generated.tcl[26G[1@mixed_serializer_synth.tcl
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000002_00000004_00000003'
Removing library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
Removing library 'gtech'
Removing library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Removing library 'standard.sldb'
Removing library 'dw_foundation.sldb'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv
Opening include file /home/msc18h28/ma/sourcecode/mixed_serializer/parameters.vh
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/dw_foundation.sldb'
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv
Presto compilation completed successfully.
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv
Presto compilation completed successfully.
Running PRESTO HDLC
Compiling source file /home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv
Presto compilation completed successfully.
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/gtech.db'
Loading db file '/usr/pack/synopsys-2017.09-kgf/syn/libraries/syn/standard.sldb'
  Loading link library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs'
  Loading link library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
  Loading link library 'gtech'
Running PRESTO HDLC
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv:39: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine toplevel_mixed_serializer line 52 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/mixed_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Writing ddc file 'DDC/Mixed_Serializer__elab.ddc'.
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider'
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)

Information: There are 1 potential problems in your design. Please run 'check_design' for more information. (LINT-99)

Information: Uniquified 4 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_mixed_serializer'

Warning: The trip points for the library named io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB differ from those in the library named sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs. (TIM-164)
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_mixed_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'shift_serializer_00000020_00000005_00000010'
 Implement Synthetic for 'shift_serializer_00000020_00000005_00000010'.
  Processing 'Serializer_00000010_00000004_0'
  Processing 'toplevel_mixed_serializer'
  Processing 'Serializer_00000008_00000004_00000001'
  Processing 'Serializer_00000004_00000004_00000002'
  Processing 'tree_serializer_00000010_00000004'
  Processing 'Serializer_00000002_00000004_00000003'
  Processing 'Clock_divider_0'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)
Information: The register 'shift_serializer/Counter_SP_reg[1]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[2]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[3]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[5]' is a constant and will be removed. (OPT-1206)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)
  Global Optimization (Phase 30)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:10     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:10     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:10     397.6      0.00       0.0       0.0                             13.6956      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:10     396.2      0.00       0.0       0.0                             13.6357      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     396.2      0.00       0.0       0.0                             13.5032      0.00  
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
  Global Optimization (Phase 41)
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:11     396.2      0.00       0.0       0.0                             13.4984      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_mixed_serializer__1ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_1ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_1ns_synth.sdf'. (WT-3)
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)

Information: There are 1 potential problems in your design. Please run 'check_design' for more information. (LINT-99)

Information: Uniquified 4 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_mixed_serializer'

  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_mixed_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'shift_serializer_00000020_00000005_00000010'
 Implement Synthetic for 'shift_serializer_00000020_00000005_00000010'.
  Processing 'Serializer_00000010_00000004_0'
  Processing 'toplevel_mixed_serializer'
  Processing 'Serializer_00000008_00000004_00000001'
  Processing 'Serializer_00000004_00000004_00000002'
  Processing 'tree_serializer_00000010_00000004'
  Processing 'Serializer_00000002_00000004_00000003'
  Processing 'Clock_divider_0'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)
Information: The register 'shift_serializer/Counter_SP_reg[1]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[2]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[3]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[5]' is a constant and will be removed. (OPT-1206)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)
  Global Optimization (Phase 30)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  
    0:00:09     397.6      0.00       0.0       0.0                             13.6956      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:09     396.2      0.00       0.0       0.0                             13.6357      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     396.2      0.00       0.0       0.0                             13.5994      0.00  
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
  Global Optimization (Phase 41)
    0:00:09     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:09     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
    0:00:10     396.2      0.00       0.0       0.0                             13.4984      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_mixed_serializer__0.5ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_0.5ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_0.5ns_synth.sdf'. (WT-3)
Removing design 'shift_serializer_00000020_00000005_00000010'
Removing design 'Serializer_00000010_00000004_0'
Removing design 'toplevel_mixed_serializer'
Removing design 'Clock_divider_0'
Removing design 'Clock_divider_1'
Removing design 'Clock_divider_2'
Removing design 'Clock_divider_3'
Removing design 'Serializer_00000008_00000004_00000001'
Removing design 'Serializer_00000004_00000004_00000002'
Removing design 'tree_serializer_00000010_00000004'
Removing design 'Serializer_00000002_00000004_00000003'
Reading ddc file '/home/msc18h28/ma/synopsys/DDC/Mixed_Serializer__elab.ddc'.
Loaded 1 design.
Current design is 'toplevel_mixed_serializer'.
Information: Building the design 'Clock_divider'. (HDL-193)

Inferred memory devices in process
	in routine Clock_divider line 16 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/Clock_divider.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     clk_div_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'shift_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000020,32'h00000005,32'h00000010". (HDL-193)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:31: signed to unsigned conversion occurs. (VER-318)
Warning:  /home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv:37: signed to unsigned conversion occurs. (VER-318)

Inferred memory devices in process
	in routine shift_serializer_00000020_00000005_00000010 line 54 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/shift_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   Counter_SP_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|     Reg_SP_reg      | Flip-flop |  32   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'tree_serializer' instantiated from design 'toplevel_mixed_serializer' with
	the parameters "32'h00000010,32'h00000004". (HDL-193)

Inferred memory devices in process
	in routine tree_serializer_00000010_00000004 line 37 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   dataOut_SP_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'tree_serializer_00000010_00000004' with
	the parameters "32'h00000010,32'h00000004,0". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000010_00000004_0 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000010_00000004_0' with
	the parameters "32'h00000008,32'h00000004,32'h00000001". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000008_00000004_00000001 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000008_00000004_00000001' with
	the parameters "32'h00000004,32'h00000004,32'h00000002". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000004_00000004_00000002 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'Serializer' instantiated from design 'Serializer_00000004_00000004_00000002' with
	the parameters "32'h00000002,32'h00000004,32'h00000003". (HDL-193)

Inferred memory devices in process
	in routine Serializer_00000002_00000004_00000003 line 74 in file
		'/home/msc18h28/ma/sourcecode/mixed_serializer/tree_serializer.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     reg_SP_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Performing power optimization. (PWR-850)
Alib files are up-to-date.
Information: Sequential output inversion is enabled.  SVF file must be used for formal verification. (OPT-1208)

Information: There are 1 potential problems in your design. Please run 'check_design' for more information. (LINT-99)

Information: Uniquified 4 instances of design 'Clock_divider'. (OPT-1056)
  Simplifying Design 'toplevel_mixed_serializer'

  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Loaded alib file './alib/alib-52/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db.alib'
Loaded alib file './alib/alib-52/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db.alib' (placeholder)
Warning: Operating condition ss_nominal_max_0p90v_125c set on design toplevel_mixed_serializer has different process,
voltage and temperatures parameters than the parameters at which target library 
io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB is characterized. Delays may be inaccurate as a result. (OPT-998)
Information: State dependent leakage is now switched from on to off.

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'shift_serializer_00000020_00000005_00000010'
 Implement Synthetic for 'shift_serializer_00000020_00000005_00000010'.
  Processing 'Serializer_00000010_00000004_0'
  Processing 'toplevel_mixed_serializer'
  Processing 'Serializer_00000008_00000004_00000001'
  Processing 'Serializer_00000004_00000004_00000002'
  Processing 'tree_serializer_00000010_00000004'
  Processing 'Serializer_00000002_00000004_00000003'
  Processing 'Clock_divider_0'

  Updating timing information
Information: Updating design information... (UID-85)
Information: The library cell 'TIELO_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'TIEHI_X1M_A9TS' in the library 'sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKANALOG_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRKOSC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PBRK_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL10_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL5_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL2_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PFILL1NC_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PCORNER_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PVDDI_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PDVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVSS_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_V' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The library cell 'PAVDD_18_PL_H' in the library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB' is not characterized for internal power. (PWR-536)
Information: The target library(s) contains cell(s), other than black boxes, that are not characterized for internal power. (PWR-24)
Information: The register 'shift_serializer/Counter_SP_reg[1]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[2]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[3]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[4]' is a constant and will be removed. (OPT-1206)
Information: The register 'shift_serializer/Counter_SP_reg[5]' is a constant and will be removed. (OPT-1206)

  Beginning Mapping Optimizations  (Ultra High effort)
  -------------------------------
  Mapping Optimization (Phase 1)

  Beginning Constant Register Removal
  -----------------------------------

  Beginning Global Optimizations
  ------------------------------
  Numerical Synthesis (Phase 1)
  Numerical Synthesis (Phase 2)
  Global Optimization (Phase 1)
  Global Optimization (Phase 2)
  Global Optimization (Phase 3)
  Global Optimization (Phase 4)
  Global Optimization (Phase 5)
  Global Optimization (Phase 6)
  Global Optimization (Phase 7)
  Global Optimization (Phase 8)
  Global Optimization (Phase 9)
  Global Optimization (Phase 10)
  Global Optimization (Phase 11)
  Global Optimization (Phase 12)
  Global Optimization (Phase 13)
  Global Optimization (Phase 14)
  Global Optimization (Phase 15)
  Global Optimization (Phase 16)
  Global Optimization (Phase 17)
  Global Optimization (Phase 18)
  Global Optimization (Phase 19)
  Global Optimization (Phase 20)
  Global Optimization (Phase 21)
  Global Optimization (Phase 22)
  Global Optimization (Phase 23)
  Global Optimization (Phase 24)
  Global Optimization (Phase 25)
  Global Optimization (Phase 26)
  Global Optimization (Phase 27)
  Global Optimization (Phase 28)
  Global Optimization (Phase 29)
  Global Optimization (Phase 30)

  Beginning Isolate Ports
  -----------------------

  Beginning Delay Optimization
  ----------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:08     398.1      0.03       0.0       0.0                             13.7626      0.00  
    0:00:08     400.3      0.02       0.0       0.0                             13.9201      0.00  
    0:00:08     400.3      0.02       0.0       0.0                             13.9201      0.00  
    0:00:09     400.5      0.02       0.0       0.0                             13.9424      0.00  

  Beginning WLM Backend Optimization
  --------------------------------------
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     399.1      0.02       0.0       0.0                             13.8825      0.00  
    0:00:09     401.7      0.01       0.0       0.0                             14.0120      0.00  
    0:00:09     401.7      0.01       0.0       0.0                             14.0120      0.00  


  Beginning Leakage Power Optimization  (max_leakage_power 0)
  ------------------------------------

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:09     401.7      0.01       0.0       0.0                             14.0120      0.00  
  Global Optimization (Phase 31)
  Global Optimization (Phase 32)
  Global Optimization (Phase 33)
  Global Optimization (Phase 34)
  Global Optimization (Phase 35)
  Global Optimization (Phase 36)
  Global Optimization (Phase 37)
  Global Optimization (Phase 38)
  Global Optimization (Phase 39)
  Global Optimization (Phase 40)
  Global Optimization (Phase 41)
  Global Optimization (Phase 42)
    0:00:09     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:09     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:09     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8775      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  

                                  TOTAL                                                            
   ELAPSED            WORST NEG   SETUP    DESIGN                              LEAKAGE   MIN DELAY 
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT            POWER      COST    
  --------- --------- --------- --------- --------- ------------------------- --------- -----------
    0:00:10     401.7      0.01       0.0       0.0                             13.8778      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:10     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:11     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:11     401.7      0.01       0.0       0.0                             13.8861      0.00  
    0:00:11     401.5      0.01       0.0       0.0                             13.8639      0.00  
Loading db file '/home/msc18h28/ma/technology/db/sc9_soi12s0_base_svt_ss_nominal_max_0p90v_125c_mxs.db'
Loading db file '/home/msc18h28/ma/technology/db/io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
  Loading target library 'io_gppr_soi12s0_t18_mv10_mv18_avt_pl_tt_cnom_1p00v_1p80v_25c_3_20_30_00_00_02_LB'
Information: State dependent leakage is now switched from off to on.
Information: Propagating switching activity (low effort zero delay simulation). (PWR-6)
Writing ddc file 'DDC/toplevel_mixed_serializer__0.1ns.ddc'.
Writing verilog file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_0.1ns.v'.
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/msc18h28/ma/synopsys/netlists/Mixed_Serializer_0.1ns_synth.sdf'. (WT-3)
dc_shell> 